<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Mail;
use App\Mail\RoleAssignment;

class GameController extends Controller
{
    public function index()
    {
        return view('game');
    }

    public function startGame(Request $request)
    {

        $request->validate([
            'emails' => 'required|array|min:3',
            'emails.*' => 'required|email|distinct',
        ]);

        $players = $request->input('emails');
        $playerCount = count($players);

        $impostorCount = max(1, floor($playerCount / 3));

        $wordBank = [
            'Σκύλος', 'Πίτσα', 'Τραπέζι', 'Λάπτοπ', 'Αυτοκίνητο', 'Γιατρός', 'Σπίτι', 'Δράκος', 'Πουκάμισο', 'Κεφάλι', 'Κιθάρα',
            'Γάτα', 'Μπέργκερ', 'Καρέκλα', 'Τάμπλετ', 'Λεωφορείο', 'Νοσοκόμα', 'Διαμέρισμα', 'Μονόκερος', 'Παντελόνι', 'Μαλλιά', 'Πιάνο',
            'Ελέφαντας', 'Σούσι', 'Κρεβάτι', 'Πληκτρολόγιο', 'Τρένο', 'Δάσκαλος', 'Ξενοδοχείο', 'Φοίνικας', 'Φόρεμα', 'Πρόσωπο', 'Τύμπανο',
            'Λιοντάρι', 'Ζυμαρικά', 'Καναπές', 'Ποντίκι', 'Αεροπλάνο', 'Μαθητής', 'Σχολείο', 'Γοργόνα', 'Φούστα', 'Μάτι', 'Βιολί',
            'Τίγρης', 'Σαλάτα', 'Λάμπα', 'Οθόνη', 'Βάρκα', 'Μηχανικός', 'Πανεπιστήμιο', 'Φάντασμα', 'Παπούτσι', 'Αυτί', 'Φλάουτο',
            'Αρκούδα', 'Μήλο', 'Υπολογιστής', 'Εκτυπωτής', 'Ποδήλατο', 'Δικηγόρος', 'Νοσοκομείο', 'Βρικόλακας', 'Κάλτσα', 'Μύτη', 'Τρομπέτα',
            'Ζέβρα', 'Μπανάνα', 'Τηλέφωνο', 'Σαρωτής', 'Μοτοσυκλέτα', 'Αστυνομικός', 'Κλινική', 'Λυκάνθρωπος', 'Καπέλο', 'Στόμα', 'Σαξόφωνο',
            'Καμηλοπάρδαλη', 'Πορτοκάλι', 'Τηλεόραση', 'Κάμερα', 'Σκούτερ', 'Πυροσβέστης', 'Φαρμακείο', 'Ζόμπι', 'Γάντι', 'Δόντι', 'Άρπα',
            'Μαϊμού', 'Σταφύλι', 'Ρολόι', 'Μικρόφωνο', 'Φορτηγό', 'Καλλιτέχνης', 'Τράπεζα', 'Εξωγήινος', 'Κασκόλ', 'Γλώσσα', 'Τσέλο',
            'Πιγκουίνος', 'Φράουλα', 'Καθρέφτης', 'Ηχείο', 'Βαν', 'Μουσικός', 'Ταχυδρομείο', 'Ρομπότ', 'Μπουφάν', 'Χείλος', 'Κλαρινέτο',
            'Καγκουρό', 'Καρπούζι', 'Πόρτα', 'Ακουστικά', 'Ταξί', 'Ηθοποιός', 'Βιβλιοθήκη', 'Ξωτικό', 'Παλτό', 'Λαιμός', 'Τραγούδι',
            'Πάντα', 'Σοκολάτα', 'Παράθυρο', 'Φορτιστής', 'Ασθενοφόρο', 'Μάγειρας', 'Μουσείο', 'Νάνος', 'Ζώνη', 'Ώμος', 'Μελωδία',
            'Λύκος', 'Τούρτα', 'Κλειδί', 'Μπαταρία', 'Περιπολικό', 'Αγρότης', 'Θέατρο', 'Γίγαντας', 'Γραβάτα', 'Χέρι', 'Ρυθμός',
            'Αλεπού', 'Παγωτό', 'Κλειδαριά', 'Καλώδιο', 'Πυροσβεστικό', 'Πιλότος', 'Σινεμά', 'Τρολ', 'Δαχτυλίδι', 'Αγκώνας', 'Στίχος',
            'Λαγός', 'Μπισκότο', 'Χαλί', 'Πρίζα', 'Τρακτέρ', 'Οδηγός', 'Γήπεδο', 'Μάγισσα', 'Κολιέ', 'Παλάμη', 'Νότα',
            'Ποντίκι', 'Ψωμί', 'Κουρτίνα', 'Διακόπτης', 'Ελικόπτερο', 'Μηχανικός', 'Γυμναστήριο', 'Μάγος', 'Σκουλαρίκι', 'Δάχτυλο', 'Συγχορδία',
            'Χάμστερ', 'Τυρί', 'Μαξιλάρι', 'Φακός', 'Τζετ', 'Ηλεκτρολόγος', 'Πάρκο', 'Νεράιδα', 'Βραχιόλι', 'Αντίχειρας', 'Μπάντα',
            'Αετός', 'Γάλα', 'Κουβέρτα', 'Ανεμιστήρας', 'Πύραυλος', 'Υδραυλικός', 'Ζωολογικός', 'Άγγελος', 'Ρολόι', 'Στήθος', 'Ορχήστρα',
            'Κουκουβάγια', 'Καφές', 'Σεντόνι', 'Σόμπα', 'Διαστημόπλοιο', 'Ξυλουργός', 'Ενυδρείο', 'Δαίμονας', 'Γυαλιά', 'Κοιλιά', 'Συναυλία',
            'Καρχαρίας', 'Τσάι', 'Πάπλωμα', 'Κλιματιστικό', 'Υποβρύχιο', 'Επιστήμονας', 'Παραλία', 'Θεός', 'Μπότα', 'Πλάτη', 'Χορός',
            'Φάλαινα', 'Χυμός', 'Φλιτζάνι', 'Ψυγείο', 'Πλοίο', 'Αστροναύτης', 'Δάσος', 'Θεά', 'Σανδάλι', 'Πόδι', 'Ζωγραφιά',
            'Δελφίνι', 'Αναψυκτικό', 'Ποτήρι', 'Φούρνος', 'Γιοτ', 'Στρατιώτης', 'Βουνό', 'Ήρωας', 'Παντόφλα', 'Γόνατο', 'Σχέδιο',
            'Χταπόδι', 'Μπύρα', 'Πιάτο', 'Μικροκύματα', 'Φέρι', 'Ντετέκτιβ', 'Ποτάμι', 'Κακός', 'Τακούνι', 'Πατούσα', 'Γλυπτό',
            'Αράχνη', 'Κρασί', 'Μπολ', 'Τοστιέρα', 'Κανό', 'Κατάσκοπος', 'Λίμνη', 'Τέρας', 'Αθλητικό', 'Καρδιά', 'Φωτογραφία',
            'Φίδι', 'Κοτόπουλο', 'Πιρούνι', 'Μίξερ', 'Καγιάκ', 'Δικαστής', 'Θάλασσα', 'Θηρίο', 'Στολή', 'Εγκέφαλος', 'Ταινία',
            'Σαύρα', 'Μπριζόλα', 'Κουτάλι', 'Βραστήρας', 'Πατίνι', 'Βασιλιάς', 'Ωκεανός', 'Πνεύμα', 'Κοστούμι', 'Πνεύμονας', 'Θέατρο',
            'Βάτραχος', 'Ψάρι', 'Μαχαίρι', 'Πλυντήριο', 'Τρόλεϊ', 'Βασίλισσα', 'Έρημος', 'Ψυχή', 'Πιτζάμα', 'Κόκαλο', 'Ποίημα',
            'Χελώνα', 'Ρύζι', 'Μπουκάλι', 'Σίδερο', 'Μετρό', 'Πρίγκιπας', 'Ζούγκλα', 'Μαγεία', 'Μαγιό', 'Αίμα', 'Ιστορία',
            'Πεταλούδα', 'Πατάτα', 'Κουτί', 'Σεσουάρ', 'Τραμ', 'Πριγκίπισσα', 'Νησί', 'Κένταυρος', 'Μπικίνι', 'Δέρμα', 'Βιβλίο',
            'Μέλισσα', 'Ντομάτα', 'Βάζο', 'Σφυρί', 'Τελεφερίκ', 'Μάγος', 'Σπηλιά', 'Μινώταυρος', 'Σορτς', 'Νύχι', 'Μουσείο',
            'Μυρμήγκι', 'Κρεμμύδι', 'Τσάντα', 'Κατσαβίδι', 'Ασανσέρ', 'Συγγραφέας', 'Κάστρο', 'Σκαθάρι', 'Σκόρδο', 'Σακίδιο', 'Κλειδί',
            'Κυλιόμενες', 'Δημοσιογράφος', 'Παλάτι', 'Σκορπιός', 'Πιπέρι', 'Πορτοφόλι', 'Πένσα', 'Γέφυρα', 'Φωτογράφος', 'Πύργος',
            'Κάβουρας', 'Αλάτι', 'Ομπρέλα', 'Πριόνι', 'Τούνελ', 'Σκηνοθέτης', 'Γέφυρα', 'Αστακός', 'Ζάχαρη', 'Χτένα', 'Τρυπάνι',
            'Δρόμος', 'Σχεδιαστής', 'Εκκλησία', 'Μέδουσα', 'Βούτυρο', 'Βούρτσα', 'Καρφί', 'Αυτοκινητόδρομος', 'Προγραμματιστής', 'Τζαμί',
            'Αστερίας', 'Λάδι', 'Οδοντόβουρτσα', 'Βίδα', 'Λιμάνι', 'Gamer', 'Ναός', 'Ιππόκαμπος', 'Ξύδι', 'Σαπούνι', 'Παξιμάδι',
            'Αεροδρόμιο', 'Αθλητής', 'Μοναστήρι', 'Κοράλλι', 'Σάλτσα', 'Πετσέτα', 'Μέτρο', 'Σταθμός', 'Προπονητής', 'Καθεδρικός',
            'Στρείδι', 'Σούπα', 'Σφουγγάρι', 'Σκάλα', 'Στάση', 'Διαιτητής', 'Φάρος', 'Καμήλα', 'Τοστ', 'Σαμπουάν', 'Φτυάρι',
            'Γάιδαρος', 'Τηγανίτα', 'Άρωμα', 'Τσουγκράνα', 'Κουρέας', 'Φάρμα', 'Άλογο', 'Βάφλα', 'Καλλυντικά', 'Τσεκούρι', 'Κομμώτρια', 'Αχυρώνας',
            'Αγελάδα', 'Αυγό', 'Ξυράφι', 'Αλυσίδα', 'Φούρνας', 'Εργοστάσιο', 'Γουρούνι', 'Μπέικον', 'Ψαλίδι', 'Σχοινί', 'Κρεοπώλης', 'Αποθήκη',
            'Πρόβατο', 'Λουκάνικο', 'Σελοτέιπ', 'Κουβάς', 'Ψαράς', 'Γραφείο', 'Κατσίκα', 'Ζαμπόν', 'Κόλλα', 'Σφουγγαρίστρα', 'Αρχιτέκτονας', 'Κατάστημα',
            'Κότα', 'Μοσχάρι', 'Χαρτί', 'Σκούπα', 'Οδοντίατρος', 'Μαγαζί', 'Πάπια', 'Χοιρινό', 'Στυλό', 'Φαράσι', 'Κτηνίατρος', 'Εμπορικό',
            'Γαλοπούλα', 'Αρνί', 'Μολύβι', 'Ταχυδρόμος', 'Αγορά', 'Κροκόδειλος', 'Τάκος', 'Τετράδιο', 'Σερβιτόρος', 'Εστιατόριο',
            'Αλιγάτορας', 'Μπουρίτο', 'Βιβλίο', 'Γορίλας', 'Νάτσος', 'Περιοδικό', 'Χιμπατζής', 'Πατατάκια', 'Εφημερίδα', 'Κοάλα',
            'Ποπκορν', 'Γράμμα', 'Πλατύποδας', 'Ντόνατ', 'Φάκελος', 'Ρακούν', 'Κρουασάν', 'Γραμματόσημο', 'Σκίουρος', 'Μάφιν',
            'Ημερολόγιο', 'Νυχτερίδα', 'Κουλούρι', 'Χάρτης', 'Σκαντζόχοιρος', 'Τσουρέκι', 'Υδρόγειος', 'Παγώνι', 'Ανανάς', 'Παπαγάλος',
            'Μάνγκο', 'Φλαμίνγκο', 'Ροδάκινο', 'Κύκνος', 'Αχλάδι', 'Χήνα', 'Κεράσι', 'Περιστέρι', 'Λεμόνι', 'Κοράκι', 'Λάιμ',
            'Γεράκι', 'Αβοκάντο', 'Τσικνιάς', 'Καρύδα', 'Στρουθοκάμηλος', 'Βατόμουρο', 'Ρινόκερος', 'Καρότο', 'Ιπποπόταμος', 'Μπρόκολο',
            'Βουβάλι', 'Σπανάκι', 'Ελάφι', 'Καλαμπόκι', 'Τάρανδος', 'Αρακάς', 'Βίσονας', 'Φασόλια', 'Γαζέλα', 'Μανιτάρι', 'Τσιτάχ',
            'Κολοκύθα', 'Λεοπάρδαλη', 'Αγγούρι', 'Πάνθηρας', 'Μαρούλι', 'Σουβλάκι', 'Γύρος', 'Μουσακάς', 'Παστίτσιο', 'Φέτα',
            'Ελιά', 'Ούζο', 'Τσίπουρο', 'Κουραμπιές', 'Μελομακάρονο'
        ];

        // Pick 2 distinct random keys
        $randomKeys = array_rand($wordBank, 2);
        $crewWord = $wordBank[$randomKeys[0]];
        $impostorWord = $wordBank[$randomKeys[1]];

        $randomIndices = array_rand($players, $impostorCount);


        if (!is_array($randomIndices)) {
            $randomIndices = [$randomIndices];
        }


        foreach ($players as $index => $email) {

            // Check if current player index is in the list of impostors
            $isImpostor = in_array($index, $randomIndices);

            // Assign word
            $assignedWord = $isImpostor ? $impostorWord : $crewWord;

            // Send email
            Mail::to($email)->send(new RoleAssignment($isImpostor, $assignedWord));
        }

        return back()
            ->with('status', "Το email στάλθηκε σε $playerCount παίκτες!")
            ->withInput();
    }
}
